In [5]:
import pandas as pd
visa_df=pd.read_csv(r"C:\Users\saite\Downloads\Visadataset.csv")
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [9]:
type(visa_df)

pandas.core.frame.DataFrame

In [11]:
len(visa_df)

25480

In [15]:
visa_df.shape

(25480, 12)

In [19]:
visa_df.size

305760

In [21]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [27]:
print(f"no of rows in the dataframe visa_df is {visa_df.shape[0]}")
print(f"no of columns in the dataframe visa_df is {visa_df.shape[1]}")

no of rows in the dataframe visa_df is 25480
no of columns in the dataframe visa_df is 12

**finding size of dataframe using "shape" function**

In [29]:
print(f" size of the visa_df datframe is {visa_df.shape[0]*visa_df.shape[1]}")

 size of the visa_df datframe is 305760

**columns**

**finding length of columns in the dataframe using ^ columns function then typcasting it into list datatype and "finding length of it" ^**

In [34]:
len(list(visa_df.columns))

12

**finding the index of a column(heading)**

In [38]:
list(visa_df.columns).index('full_time_position')

10

**head only givesd top5 'element's data in the dataframe**

In [41]:
visa_df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

**tail only givesd top5 'element's data in the dataframe**

In [44]:
visa_df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [46]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [52]:
type(visa_df.dtypes)

pandas.core.series.Series

In [67]:
visa_df.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

**way of displaying data using series ,dtypes**

In [64]:
dtyp=visa_df.dtypes
list(dtyp.keys())[1:]

['continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [156]:
dtyp

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [50]:
dtyp.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

**extract numerical and categorical columns**

In [72]:
cat=[]
num=[]
for i,j in dtyp.items():
    if j=="object":
        cat.append(i)
    else:
        num.append(i)
print(f"{cat}")
print(f"{num}")

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

**extract numerical and categorical columns by applying ,list comprehension**

In [79]:
cat_cols=[i for i,j in dtyp.items() if j=="object"]
num_cols=[i for i,j in dtyp.items() if j!="object"]
print(cat_cols)
num_cols

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']

['no_of_employees', 'yr_of_estab', 'prevailing_wage']

**select dtypes**

In [88]:
visa_df.select_dtypes(include=object).columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [90]:
visa_df.select_dtypes(exclude=object).columns

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

**apply head along with select_dtypes**

In [92]:
visa_df.select_dtypes(exclude=object).head()

   no_of_employees  yr_of_estab  prevailing_wage
0            14513         2007         592.2029
1             2412         2002       83425.6500
2            44444         2008      122996.8600
3               98         1897       83434.0300
4             1082         2005      149907.3900

**apply tail along with select_dtypes**

In [94]:
visa_df.select_dtypes(exclude=object).tail()

       no_of_employees  yr_of_estab  prevailing_wage
25475             2601         2008         77092.57
25476             3274         2006        279174.79
25477             1121         1910        146298.85
25478             1918         1887         86154.77
25479             3195         1960         70876.91

**apply slicing  along with select_dtypes**

In [100]:
visa_df.select_dtypes(exclude=object)[300:500]

     no_of_employees  yr_of_estab  prevailing_wage
300             3268         2012      101371.2100
301             1312         1998       93644.4700
302              229         2005         248.0100
303             2597         1945      155042.9900
304             2114         1977         596.2488
..               ...          ...              ...
495               46         1948       92218.7600
496            36353         1998      125925.7100
497             3514         2010       24197.9200
498             1110         1963       97931.9900
499              553         1979       61744.5700

[200 rows x 3 columns]

**info**

In [103]:
visa_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

**take**

In [109]:
visa_df.take([7,8],axis=1)

      region_of_employment  prevailing_wage
0                     West         592.2029
1                Northeast       83425.6500
2                     West      122996.8600
3                     West       83434.0300
4                    South      149907.3900
...                    ...              ...
25475                South       77092.5700
25476            Northeast      279174.7900
25477                South      146298.8500
25478                 West       86154.7700
25479              Midwest       70876.9100

[25480 rows x 2 columns]

In [113]:
visa_df.take([1,8],axis=0)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.65,Year,Y,Certified
8,EZYV09,Asia,Bachelor's,N,N,4810,2012,Midwest,74362.19,Year,Y,Certified

**from drawback of single take operation**

In [186]:
visa_df.take([1,3,5],axis=0).take([2,3,4,7,8],axis=1)# directly accessing specific rows and columns with "2 take operations"

,education_of_employee,has_job_experience,requires_job_training,region_of_employment,prevailing_wage
1,Master's,Y,N,Northeast,83425.65
3,Bachelor's,N,N,West,83434.03
5,Master's,Y,N,South,78252.14

**iloc**

In [126]:
df1=pd.DataFrame(dtyp.items(),columns=['Column Name','Data Type'],index=range(1,13))
df1

              Column Name Data Type
1                 case_id    object
2               continent    object
3   education_of_employee    object
4      has_job_experience    object
5   requires_job_training    object
6         no_of_employees     int64
7             yr_of_estab     int64
8    region_of_employment    object
9         prevailing_wage   float64
10           unit_of_wage    object
11     full_time_position    object
12            case_status    object

In [128]:
df1.iloc[3:9]

             Column Name Data Type
4     has_job_experience    object
5  requires_job_training    object
6        no_of_employees     int64
7            yr_of_estab     int64
8   region_of_employment    object
9        prevailing_wage   float64

- dataframe.iloc(rows,columns)
- dataframe.iloc([rows],[columns])
- dataframe.iloc(start:stop:step,start:stop:step)

In [167]:
visa_df.iloc[1:5,1:4]#by default step=1

  continent education_of_employee has_job_experience
1      Asia              Master's                  Y
2      Asia            Bachelor's                  N
3      Asia            Bachelor's                  N
4    Africa              Master's                  Y

In [169]:
visa_df.iloc[1:6:2,4:9]

,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage
1,N,2412,2002,Northeast,83425.65
3,N,98,1897,West,83434.03
5,N,2339,2012,South,78252.14

In [171]:
rows=[1,3,8]
cols=[2,1,9]
visa_df.iloc[rows,cols]

  education_of_employee continent unit_of_wage
1              Master's      Asia         Year
3            Bachelor's      Asia         Year
8            Bachelor's      Asia         Year

In [173]:
visa_df.iloc[[1,6,2],8]

1     83425.65
6     53635.39
2    122996.86
Name: prevailing_wage, dtype: float64

In [175]:
visa_df.iloc[[1,5,1],[2,8,2]]

  education_of_employee  prevailing_wage education_of_employee
1              Master's         83425.65              Master's
5              Master's         78252.14              Master's
1              Master's         83425.65              Master's

In [177]:
visa_df.iloc[[1,6,1],['prevailing_wage']]

IndexError: .iloc requires numeric indexers, got ['prevailing_wage']

In [179]:
visa_df.loc[[1,6,2],['prevailing_wage']]

   prevailing_wage
1         83425.65
6         53635.39
2        122996.86

In [181]:
#series
visa_df['continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [183]:
#dataframe
visa_df[['continent']]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

**loc**

In [131]:
visa_df.loc[2:9]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
5,EZYV06,Asia,Master's,Y,N,2339,2012,South,78252.1400,Year,Y,Certified
6,EZYV07,Asia,Bachelor's,N,N,4985,1994,South,53635.3900,Year,Y,Certified
7,EZYV08,North America,Bachelor's,Y,N,3035,1924,West,418.2298,Hour,Y,Denied
8,EZYV09,Asia,Bachelor's,N,N,4810,2012,Midwest,74362.1900,Year,Y,Certified
9,EZYV10,Europe,Doctorate,Y,N,2251,1995,South,67514.7600,Year,Y,Certified

**method1**

In [146]:
st=df1.dtypes
st

Column Name    object
Data Type      object
dtype: object

In [142]:
df1.dtypes.items()

In [148]:
st.items()

In [152]:
st.index

Index(['Column Name', 'Data Type'], dtype='object')